<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

//使用路由的方式实现，地址一旦被定义过路由以后，之前的地址就会失效
use think\Route;

Route::get('api/v1/banner/:id','api/v1.Banner/getBanner');//路由地址顺序：模块/控制器名/方法
